'''
Создать текстовый файл (не программно), сохранить в нем несколько строк,
выполнить подсчет количества строк, количества слов в каждой строке.
'''

with open("test_file.txt") as f_obj:
    for i, line in enumerate(f_obj):
        print(f'В {i+1} строке  слов {len(line.split())}')
print(f'Всего строк {i}')
