'''
Сформировать (не программно) текстовый файл. В нём каждая строка должна описывать учебный предмет
и наличие лекционных, практических и лабораторных занятий по предмету. Сюда должно входить и количество занятий.
Необязательно, чтобы для каждого предмета были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести его на экран.
'''

my_dict = {}
with open("test_6.txt", encoding="utf-8") as f:
    for line in f:
        name, stats = line.split(':')
        elems = [i for i in stats if i == " " or (i >= '0' and i <= '9')]
        print(elems)
        name_sum = sum(map(int, "".join(elems).split()))
        my_dict[name] = name_sum
print(f"{my_dict}")
