'''
Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
толщиной в 1 см * число см толщины полотна. Проверить работу метода.
Например: 20м * 5000м * 25кг * 5см = 12500 т
'''
class Road:

    def __init__(self, length, width):
        self._length = length
        self._width = width

    def massa_road(self):
        self.__massa_1_m2 = float(input("Введите массу асфальта в кг для покрытия одного кв метра толщиной 1 см - "))
        self.__thickness_sm = float(input("Введите толщину покрытия асфальта в см - "))
        massa = (self._length * self._width * self.__massa_1_m2 * self.__thickness_sm) / 1000
        print(f"Масса дорожного полотна длиной {self._length} м и шириной {self._width} м равна {massa} т ")


m_r = Road(1000, 20)
m_r.massa_road()

