'''
Реализовать проект расчёта суммарного расхода ткани на производство одежды. Основная сущность
(класс) этого проекта — одежда, которая может иметь определённое название. К типам одежды в
этом проекте относятся пальто и костюм. У этих типов одежды существуют параметры: размер (для пальто)
 и рост (для костюма). Это могут быть обычные числа: V и H, соответственно.
Для определения расхода ткани по каждому типу одежды использовать формулы: для пальто (V/6.5 + 0.5),
 для костюма (2*H + 0.3). Проверить работу этих методов на реальных данных.
Реализовать общий подсчет расхода ткани. Проверить на практике полученные на этом уроке знания:
 реализовать абстрактные классы для основных классов проекта, проверить на практике работу декоратора @property.
'''
from abc import ABC, abstractmethod


class Clothes(ABC):

    def __init__(self, param):
        self.param = param

    @abstractmethod
    def expense(self):
        pass

    def __str__(self):
        return str(self.param)


class Coat(Clothes):

    @property
    def expense(self):
        return self.param / 6.5 + 0.5


class Suit(Clothes):

    @property
    def expense(self):
        return self.param * 2 + 0.3


a = Coat(int(input('Введите размер пальто как совокупность двух натуральных чисел от 0 до 9: ')))
print(f'Размер пальто = {a}')
print(f'Расход ткани на пальто = {round(a.expense,2)}')
b = Suit(float(input('Введите рост костюма как совокупность натуральных чисел от 0 до 9 в виде десятичной дроби: ')))
print(f'Рост костюма = {b}')
print(f'Расход ткани на костюм = {round(b.expense,2)}')
print(f'Общий расход ткани на пальто и костюм = {round(a.expense + b.expense,2)}')

